#### TileBrickType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "TileBrickType" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TileBrickType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TileBrickType ``` |

| Visual C++ |
| --- |
| ``` public enum class TileBrickType ``` |

# Members

| Member name | Description |
| --- | --- |
| RunningBond |  |
| CommonFlemishBond |  |
| EnglishBond |  |
| HalfRunningBond |  |
| StackBond |  |
| FineRunningBond |  |
| FineStackBond |  |
| Custom |  |

# See Also

Autodesk.Revit.DB.Visual Namespace